# IsValidRoughness Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctLiningType..::..IsValidRoughness Method
DuctLiningType Class See Also
---
Identifies if the input roughness is valid.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsValidRoughness(
	double roughness
)
```

Visual Basic
---
```text
Public Function IsValidRoughness ( _
	roughness As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidRoughness(
	double roughness
)
```

# ### Parameters
roughness
    Type: System..::..Double The roughness to check.
# ### Return Value
True if the value is acceptable, false otherwise.
# Remarks
Roughness should be at least equal to or larger than 0.
# See Also
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace